Revit 2026 API

# ApplicationNewColor Method

---

Returns a new color object.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color NewColor()
```
```vb
Public Function NewColor As Color
```
```cpp
public:
Color^ NewColor()
```
```fsharp
member NewColor : unit -> Color
```

#### Return Value

ColorThe new color object.

#### Reference

Application Class

Autodesk.Revit.Creation Namespace